results/2021_06_23/scenario_4/hey/HTTP/raw

[mick@colossus-guardian CG]$ ./rr
===========================================
scenario_4 1 sender TEST 1
===========================================

Summary:
  Total:	60.0009 secs
  Slowest:	0.0050 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2801.6930
  
  Total data:	1424513296 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [168090]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [11]	|
  0.002 [1]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [0]	|
  0.005 [1]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0004 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0050 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0003 secs, 0.0002 secs, 0.0031 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	168104 responses



===========================================
scenario_4 1 sender TEST 2
===========================================

Summary:
  Total:	60.0009 secs
  Slowest:	0.0024 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2817.8086
  
  Total data:	1432707654 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [168890]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [165]	|
  0.001 [5]	|
  0.001 [7]	|
  0.001 [2]	|
  0.002 [0]	|
  0.002 [0]	|
  0.002 [0]	|
[...]
  0.002 [1]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0003 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0004 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0024 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0003 secs, 0.0002 secs, 0.0024 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	169071 responses



===========================================
scenario_4 1 sender TEST 3
===========================================

Summary:
  Total:	60.0010 secs
  Slowest:	0.0014 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2816.2176
  
  Total data:	1431902624 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [163235]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [5659]	|■
  0.001 [58]	|
  0.001 [8]	|
  0.001 [4]	|
  0.001 [4]	|
  0.001 [2]	|
  0.001 [4]	|
  0.001 [0]	|
  0.001 [1]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0003 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0004 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0014 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0003 secs, 0.0002 secs, 0.0013 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	168976 responses



===========================================
scenario_4 1 sender TEST 4
===========================================

Summary:
  Total:	60.0008 secs
  Slowest:	0.0012 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2795.9809
  
  Total data:	1421606714 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [129580]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.000 [37792]	|■■■■■■■■■■■■
  0.001 [309]	|
  0.001 [54]	|
  0.001 [8]	|
  0.001 [5]	|
  0.001 [2]	|
  0.001 [6]	|
  0.001 [2]	|
  0.001 [2]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0004 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0012 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0003 secs, 0.0002 secs, 0.0005 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [200]	167761 responses



===========================================
scenario_4 1 sender TEST 5
===========================================

Summary:
  Total:	60.0003 secs
  Slowest:	0.0013 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2791.5550
  
  Total data:	1419344156 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [136885]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.000 [30298]	|■■■■■■■■■
  0.001 [257]	|
  0.001 [31]	|
  0.001 [6]	|
  0.001 [4]	|
  0.001 [2]	|
  0.001 [4]	|
  0.001 [3]	|
  0.001 [3]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0004 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0013 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0003 secs, 0.0002 secs, 0.0009 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	167494 responses



===========================================
scenario_4 10 senders TEST 1
===========================================

Summary:
  Total:	60.0018 secs
  Slowest:	0.0048 secs
  Fastest:	0.0004 secs
  Average:	0.0013 secs
  Requests/sec:	7707.0794
  
  Total data:	3918708086 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [84]	|
  0.001 [202164]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [259573]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [589]	|
  0.003 [17]	|
  0.003 [1]	|
  0.003 [0]	|
  0.004 [2]	|
  0.004 [2]	|
  0.005 [6]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0012 secs
  50% in 0.0013 secs
  75% in 0.0014 secs
  90% in 0.0014 secs
  95% in 0.0015 secs
  99% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0048 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0034 secs
  resp wait:	0.0012 secs, 0.0002 secs, 0.0022 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0035 secs

Status code distribution:
  [200]	462439 responses



===========================================
scenario_4 10 senders TEST 2
===========================================

Summary:
  Total:	60.0019 secs
  Slowest:	0.0074 secs
  Fastest:	0.0004 secs
  Average:	0.0013 secs
  Requests/sec:	7694.1177
  
  Total data:	3912123788 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [16617]	|■
  0.002 [444830]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [208]	|
  0.003 [4]	|
  0.004 [0]	|
  0.005 [0]	|
  0.005 [0]	|
  0.006 [0]	|
  0.007 [0]	|
  0.007 [2]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0012 secs
  50% in 0.0013 secs
  75% in 0.0014 secs
  90% in 0.0014 secs
  95% in 0.0015 secs
  99% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0074 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0012 secs, 0.0002 secs, 0.0073 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0060 secs

Status code distribution:
  [200]	461662 responses



===========================================
scenario_4 10 senders TEST 3
===========================================

Summary:
  Total:	60.0019 secs
  Slowest:	0.0032 secs
  Fastest:	0.0004 secs
  Average:	0.0013 secs
  Requests/sec:	7692.3547
  
  Total data:	3911225544 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [25]	|
  0.001 [508]	|
  0.001 [132102]	|■■■■■■■■■■■■■■■■
  0.002 [324129]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [4680]	|■
  0.002 [98]	|
  0.002 [6]	|
  0.003 [3]	|
  0.003 [3]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0012 secs
  50% in 0.0013 secs
  75% in 0.0014 secs
  90% in 0.0014 secs
  95% in 0.0014 secs
  99% in 0.0015 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0032 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0012 secs, 0.0002 secs, 0.0022 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0020 secs

Status code distribution:
  [200]	461556 responses



===========================================
scenario_4 10 senders TEST 4
===========================================

Summary:
  Total:	60.0015 secs
  Slowest:	0.0036 secs
  Fastest:	0.0004 secs
  Average:	0.0013 secs
  Requests/sec:	7567.0999
  
  Total data:	3847509538 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [31]	|
  0.001 [188]	|
  0.001 [258636]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [193866]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1265]	|
  0.002 [36]	|
  0.003 [7]	|
  0.003 [2]	|
  0.003 [3]	|
  0.004 [2]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0012 secs
  50% in 0.0013 secs
  75% in 0.0014 secs
  90% in 0.0015 secs
  95% in 0.0015 secs
  99% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0036 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0012 secs, 0.0003 secs, 0.0032 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0025 secs

Status code distribution:
  [200]	454037 responses



===========================================
scenario_4 10 senders TEST 5
===========================================

Summary:
  Total:	60.0016 secs
  Slowest:	0.0028 secs
  Fastest:	0.0004 secs
  Average:	0.0013 secs
  Requests/sec:	7541.2528
  
  Total data:	3834374838 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [29]	|
  0.001 [79]	|
  0.001 [9931]	|■
  0.001 [291927]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [147150]	|■■■■■■■■■■■■■■■■■■■■
  0.002 [3144]	|
  0.002 [203]	|
  0.002 [18]	|
  0.003 [4]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0013 secs
  50% in 0.0013 secs
  75% in 0.0014 secs
  90% in 0.0014 secs
  95% in 0.0015 secs
  99% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0028 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0012 secs, 0.0002 secs, 0.0021 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	452487 responses



[mick@colossus-guardian CG]$